DataProcessors/ПодборЗамен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ПодборЗамен</Name>
			<Comment>Подбор замен</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаДату</Name>
					<Comment>Остатки на дату</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеВСправочнике</Name>
					<Comment>Наличие номенклатуры в справочнике</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВНаличииНаСкладе</Name>
					<Comment>Наличие номенклатуры на складе</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаЗамен</Name>
					<Comment>Таблица замен</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АртикулСтарый</Name>
							<Comment>Старый артикул</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АртикулНовый</Name>
							<Comment>Новый артикул</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Производитель</Name>
							<Comment>Производитель</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Производители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шаг</Name>
							<Comment>Шаг</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаЗаменСтарые</Name>
					<Comment>Таблица старых замен</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Шаг</Name>
							<Comment>Шаг</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Comment>Старый артикул</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Производитель</Name>
							<Comment>Производитель</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Производители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количественный остаток товара на складе</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаЗаменНовые</Name>
					<Comment>Таблица новых замен</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Шаг</Name>
							<Comment>Шаг</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Comment>Новый артикул</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Производитель</Name>
							<Comment>Производитель</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Производители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количественный остаток товара на складе</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/Замены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Замены</Name>
			<Comment>Замены</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Группа</Name>
					<Comment>Группа замены</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество замены</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗамены</Name>
					<Comment>Дата замены</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Comment>Дата обновления</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Comment>Описание замены</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Номер по каталогу номенклатуры</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АртикулЗамены</Name>
					<Comment>Номер по каталогу номенклатуры замены</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АртикулДляПоиска</Name>
					<Comment>Номер для поиска по каталогу номенклатуры</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АртикулЗаменыДляПоиска</Name>
					<Comment>Номер для поиска по каталогу номенклатуры замены</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Производитель</Name>
					<Comment>Производитель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ПодборЗамен/Ext/ObjectModule.bsl
Перем НоменклатураНаличиеЗамен;

// Проверяет наличие замен у данной номенклатуры
//
// Параметры
//  НоменклатураЗамены  - СправочникСсылка.Номенклатура - Номенклатура,
//					наличие замен которой требуется проверить
//
// Возвращаемое значение:
//   Булево   - Наличие замен у данной номенклатуры
//
Функция ПроверитьНаличиеЗамен(НоменклатураЗамены) Экспорт
	
	Если ТипЗнч(НоменклатураЗамены)=Тип("СправочникСсылка.Номенклатура") Тогда
		Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		                    |	Замены.АртикулДляПоиска КАК Артикул,
		                    |	Замены.АртикулЗаменыДляПоиска КАК АртикулЗамены,
		                    |	Замены.Производитель КАК Производитель,
		                    |	Замены.Количество КАК Количество,
		                    |	Замены.ДатаЗамены КАК ДатаЗамены,
		                    |	Замены.ДатаОбновления КАК ДатаОбновления,
		                    |	Замены.Описание КАК Описание
		                    |ИЗ
		                    |	РегистрСведений.Замены КАК Замены
		                    |ГДЕ
		                    |	Замены.АртикулДляПоиска = &Артикул
		                    |	И Замены.Производитель = &Производитель
		                    |
		                    |ОБЪЕДИНИТЬ ВСЕ
		                    |
		                    |ВЫБРАТЬ ПЕРВЫЕ 1
		                    |	Замены.АртикулДляПоиска,
		                    |	Замены.АртикулЗаменыДляПоиска,
		                    |	Замены.Производитель,
		                    |	Замены.Количество,
		                    |	Замены.ДатаЗамены,
		                    |	Замены.ДатаОбновления,
		                    |	Замены.Описание
		                    |ИЗ
		                    |	РегистрСведений.Замены КАК Замены
		                    |ГДЕ
		                    |	Замены.АртикулЗаменыДляПоиска = &Артикул
		                    |	И Замены.Производитель = &Производитель");
		Если обЗначениеНеЗаполнено(НоменклатураЗамены) Тогда
			Возврат Ложь;
		КонецЕсли; 
		Если ПустаяСтрока(НоменклатураЗамены.Артикул) Тогда
			Возврат Ложь;
		КонецЕсли; 
		Если НоменклатураНаличиеЗамен.НайтиПоЗначению(НоменклатураЗамены)<>Неопределено Тогда
			Возврат Истина;
		КонецЕсли; 
		Запрос.УстановитьПараметр("Артикул",НоменклатураЗамены.Артикул);
		Запрос.УстановитьПараметр("Производитель",НоменклатураЗамены.Производитель);
		ВыборкаЗапроса=Запрос.Выполнить().Выбрать();
		Если ВыборкаЗапроса.Следующий() Тогда
			НоменклатураНаличиеЗамен.Добавить(НоменклатураЗамены);
			Возврат Истина;
		КонецЕсли; 
		Возврат Ложь;
		
	ИначеЕсли ТипЗнч(НоменклатураЗамены)=Тип("ТаблицаЗначений") Тогда
		Запрос=Новый Запрос("ВЫБРАТЬ
							|	НоменклатураЗамены.Номенклатура КАК Номенклатура
							|ПОМЕСТИТЬ ВременнаяТаблицаНоменклатуры
							|ИЗ
							|	&НоменклатураЗамены КАК НоменклатураЗамены
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ РАЗЛИЧНЫЕ
							|	ВременнаяТаблицаНоменклатуры.Номенклатура КАК Номенклатура
							|ИЗ
							|	ВременнаяТаблицаНоменклатуры КАК ВременнаяТаблицаНоменклатуры
							|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Замены КАК Замены
							|		ПО (ВременнаяТаблицаНоменклатуры.Номенклатура.Артикул = Замены.АртикулДляПоиска
							|				ИЛИ ВременнаяТаблицаНоменклатуры.Номенклатура.Артикул = Замены.АртикулЗаменыДляПоиска)
							|			И ВременнаяТаблицаНоменклатуры.Номенклатура.Производитель = Замены.Производитель");
		Запрос.УстановитьПараметр("НоменклатураЗамены",НоменклатураЗамены);
		МассивНоменклатуры=Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
		НоменклатураНаличиеЗамен.ЗагрузитьЗначения(МассивНоменклатуры);
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции // ПроверитьНаличиеЗамен()

Функция ПолучитьТаблицуЗамен(Артикул=Неопределено,Производитель=Неопределено) Экспорт
	Если Артикул=Неопределено Тогда
		АртикулПоиска=Номенклатура.Артикул;
	Иначе
		АртикулПоиска=Артикул;
	КонецЕсли; 
	Если обЗначениеНеЗаполнено(Производитель) Тогда
		ПроизводительПоиска=Номенклатура.Производитель;
	Иначе
		ПроизводительПоиска=Производитель;
	КонецЕсли; 
	ЗаполнитьЗамены(АртикулПоиска,ПроизводительПоиска);
	ТаблицаЗамен.Сортировать("Шаг");
	Возврат ТаблицаЗамен.Выгрузить();
КонецФункции  

Процедура ЗаполнитьЗамены(Артикул,Производитель) Экспорт
	тзТаблицаЗамен=ТаблицаЗамен.Выгрузить();
	зфЗащищенныеФункцииСервер.ЗаполнитьЗамены(Артикул,Производитель,тзТаблицаЗамен);
	ТаблицаЗамен.Загрузить(тзТаблицаЗамен);
КонецПроцедуры

//Получение таблиц замен номенклатуры
Процедура ПолучитьЗаменыНоменклатуры(ЗаменыНовые) Экспорт 
	тзТаблицаЗамен=ТаблицаЗамен.Выгрузить();
	Если ЗаменыНовые Тогда
		тзТаблицаЗаменНовыеСтарые=ТаблицаЗаменНовые.Выгрузить();
	Иначе
		тзТаблицаЗаменНовыеСтарые=ТаблицаЗаменСтарые.Выгрузить();
	КонецЕсли; 
	зфЗащищенныеФункцииСервер.ПолучитьЗаменыНоменклатуры(ЗаменыНовые,тзТаблицаЗамен,тзТаблицаЗаменНовыеСтарые,НаличиеВСправочнике,ВНаличииНаСкладе,НаДату,СкладКомпании);
	Если ЗаменыНовые Тогда
		ТаблицаЗаменНовые.Загрузить(тзТаблицаЗаменНовыеСтарые);
	Иначе
		ТаблицаЗаменСтарые.Загрузить(тзТаблицаЗаменНовыеСтарые);
	КонецЕсли; 
КонецПроцедуры

НоменклатураНаличиеЗамен=Новый СписокЗначений;
